#### GetDirectContext3DHandleInstances Method

---

|  |
| --- |
| DirectContext3DDocumentUtils Class   See Also |

Returns all DirectContext3D handle instances of the given category in the document.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static ISet<ElementId> GetDirectContext3DHandleInstances( 	Document aDocument, 	ElementId handleCategory ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetDirectContext3DHandleInstances ( _ 	aDocument As Document, _ 	handleCategory As ElementId _ ) As ISet(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ISet<ElementId^>^ GetDirectContext3DHandleInstances( 	Document^ aDocument,  	ElementId^ handleCategory ) ``` |

#### Parameters

aDocument
:   Type:  Autodesk.Revit.DB Document
     The document.

handleCategory
:   Type:  Autodesk.Revit.DB ElementId
     A category of DirectContext3D handles.

#### Return Value

The set of DirectContext3D handle instances of the given category.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | the category ID handleCategory is not valid for DirectContext3D handles. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectContext3DDocumentUtils Class

Autodesk.Revit.DB.DirectContext3D Namespace